CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/inc/gd32a50x_dma.h
/* DMAMUX request multiplexer channel shift bit */
#define DMAMUX_RM_CHXCFG(channel)         REG32(DMAMUX_RM_CHXCFG_BASE + 0x4U * (uint32_t)(channel))              /*!< the address of DMAMUX channel CHxCFG register */

/* DMAMUX_RG_CHxCFG base address */
#define DMAMUX_RG_CHXCFG_BASE             (DMAMUX + 0x00000100U)                                                 /*!< the base address of DMAMUX channel request generator CHxCFG register */

/* DMAMUX request generator channel shift bit */
#define DMAMUX_RG_CHXCFG(channel)         REG32(DMAMUX_RG_CHXCFG_BASE + 0x4U * (uint32_t)(channel))              /*!< the address of DMAMUX channel request generator CHxCFG register */

/* DMA interrupt flag bits */
#define DMA_INT_FLAG_G                    DMA_INTF_GIF                                     /*!< global interrupt flag of channel */
#define DMA_INT_FLAG_FTF                  DMA_INTF_FTFIF                                   /*!< full transfer finish interrupt flag of channel */
#define DMA_INT_FLAG_HTF                  DMA_INTF_HTFIF                                   /*!< half transfer finish interrupt flag of channel */
#define DMA_INT_FLAG_ERR                  DMA_INTF_ERRIF                                   /*!< error interrupt flag of channel */

/* DMA flag bits */
#define DMA_FLAG_G                        DMA_INTF_GIF                                     /*!< global interrupt flag of channel */
#define DMA_FLAG_FTF                      DMA_INTF_FTFIF                                   /*!< full transfer finish flag of channel */
#define DMA_FLAG_HTF                      DMA_INTF_HTFIF                                   /*!< half transfer finish flag of channel */
#define DMA_FLAG_ERR                      DMA_INTF_ERRIF                                   /*!< error flag of channel */

/* DMA interrupt enable bits */
#define DMA_INT_FTF                       DMA_CHXCTL_FTFIE                                 /*!< enable bit for channel full transfer finish interrupt */
#define DMA_INT_HTF                       DMA_CHXCTL_HTFIE                                 /*!< enable bit for channel half transfer finish interrupt */
#define DMA_INT_ERR                       DMA_CHXCTL_ERRIE                                 /*!< enable bit for channel error interrupt */

/* DMA transfer direction */
#define DMA_PERIPHERAL_TO_MEMORY          ((uint8_t)0x00U)                                 /*!< read from peripheral and write to memory */
#define DMA_MEMORY_TO_PERIPHERAL          ((uint8_t)0x01U)                                 /*!< read from memory and write to peripheral */

/* DMA peripheral increasing mode */
#define DMA_PERIPH_INCREASE_DISABLE       ((uint32_t)0x00U)                                /*!< next address of peripheral is fixed address mode */
#define DMA_PERIPH_INCREASE_ENABLE        ((uint32_t)0x01U)                                /*!< next address of peripheral is increasing address mode */

/* DMA memory increasing mode */
#define DMA_MEMORY_INCREASE_DISABLE       ((uint32_t)0x00U)                                /*!< next address of memory is fixed address mode */
#define DMA_MEMORY_INCREASE_ENABLE        ((uint32_t)0x01U)                                /*!< next address of memory is increasing address mode */

/* DMA transfer data size of peripheral */
#define CHCTL_PWIDTH(regval)              (BITS(8,9) & ((regval) << 8U))                   /*!< transfer data size of peripheral */
#define DMA_PERIPHERAL_WIDTH_8BIT         CHCTL_PWIDTH(0U)                                 /*!< transfer data size of peripheral is 8-bit */
#define DMA_PERIPHERAL_WIDTH_16BIT        CHCTL_PWIDTH(1U)                                 /*!< transfer data size of peripheral is 16-bit */
#define DMA_PERIPHERAL_WIDTH_32BIT        CHCTL_PWIDTH(2U)                                 /*!< transfer data size of peripheral is 32-bit */

/* DMA transfer data size of memory */
#define CHCTL_MWIDTH(regval)              (BITS(10,11) & ((regval) << 10U))                /*!< transfer data size of memory */
#define DMA_MEMORY_WIDTH_8BIT             CHCTL_MWIDTH(0U)                                 /*!< transfer data size of memory is 8-bit */
#define DMA_MEMORY_WIDTH_16BIT            CHCTL_MWIDTH(1U)                                 /*!< transfer data size of memory is 16-bit */
#define DMA_MEMORY_WIDTH_32BIT            CHCTL_MWIDTH(2U)                                 /*!< transfer data size of memory is 32-bit */

/* DMA channel priority level */
#define CHCTL_PRIO(regval)                (BITS(12,13) & ((regval) << 12U))                /*!< DMA channel priority level */
#define DMA_PRIORITY_LOW                  CHCTL_PRIO(0U)                                   /*!< low priority */
#define DMA_PRIORITY_MEDIUM               CHCTL_PRIO(1U)                                   /*!< medium priority */
#define DMA_PRIORITY_HIGH                 CHCTL_PRIO(2U)                                   /*!< high priority */
#define DMA_PRIORITY_ULTRA_HIGH           CHCTL_PRIO(3U)                                   /*!< ultra high priority */

/* DMA transfer counter */
#define DMA_CHANNEL_CNT_MASK              DMA_CHXCNT_CNT                                   /*!< transfer counter mask */

/* DMAMUX request multiplexer channel input identification */
#define RM_CHXCFG_MUXID(regval)            (BITS(0,6) & ((regval) << 0U))                  /*!< multiplexer input identification */
#define DMA_REQUEST_M2M                    RM_CHXCFG_MUXID(0U)                             /*!< memory to memory transfer */
#define DMA_REQUEST_GENERATOR0             RM_CHXCFG_MUXID(1U)                             /*!< DMAMUX request generator 0 */
#define DMA_REQUEST_GENERATOR1             RM_CHXCFG_MUXID(2U)                             /*!< DMAMUX request generator 1 */
#define DMA_REQUEST_GENERATOR2             RM_CHXCFG_MUXID(3U)                             /*!< DMAMUX request generator 2 */
#define DMA_REQUEST_GENERATOR3             RM_CHXCFG_MUXID(4U)                             /*!< DMAMUX request generator 3 */
#define DMA_REQUEST_ADC                    RM_CHXCFG_MUXID(5U)                             /*!< DMAMUX ADC request */
#define DMA_REQUEST_DAC_CH0                RM_CHXCFG_MUXID(6U)                             /*!< DMAMUX DAC CH0 request */
#define DMA_REQUEST_I2C1_RX                RM_CHXCFG_MUXID(8U)                             /*!< DMAMUX I2C1 RX request */
#define DMA_REQUEST_I2C1_TX                RM_CHXCFG_MUXID(9U)                             /*!< DMAMUX I2C1 TX request */
#define DMA_REQUEST_I2C0_RX                RM_CHXCFG_MUXID(10U)                            /*!< DMAMUX I2C0 RX request */
#define DMA_REQUEST_I2C0_TX                RM_CHXCFG_MUXID(11U)                            /*!< DMAMUX I2C0 TX request */
#define DMA_REQUESR_SSTAT0                 RM_CHXCFG_MUXID(12U)                            /*!< DMAMUX SSTAT0 request */
#define DMA_REQUESR_SSTAT1                 RM_CHXCFG_MUXID(13U)                            /*!< DMAMUX SSTAT1 request */
#define DMA_REQUESR_SSTAT2                 RM_CHXCFG_MUXID(14U)                            /*!< DMAMUX SSTAT2 request */
#define DMA_REQUESR_SSTAT3                 RM_CHXCFG_MUXID(15U)                            /*!< DMAMUX SSTAT3 request */
#define DMA_REQUEST_SPI0_RX                RM_CHXCFG_MUXID(16U)                            /*!< DMAMUX SPI0 RX request */
#define DMA_REQUEST_SPI0_TX                RM_CHXCFG_MUXID(17U)                            /*!< DMAMUX SPI0 TX request */
#define DMA_REQUEST_SPI1_RX                RM_CHXCFG_MUXID(18U)                            /*!< DMAMUX SPI1 RX request */
#define DMA_REQUEST_SPI1_TX                RM_CHXCFG_MUXID(19U)                            /*!< DMAMUX SPI1 TX request */
#define DMA_REQUEST_TIMER0_CH0             RM_CHXCFG_MUXID(20U)                            /*!< DMAMUX TIMER0 CH0 request */
#define DMA_REQUEST_TIMER0_CH1             RM_CHXCFG_MUXID(21U)                            /*!< DMAMUX TIMER0 CH1 request */
#define DMA_REQUEST_TIMER0_CH2             RM_CHXCFG_MUXID(22U)                            /*!< DMAMUX TIMER0 CH2 request */
#define DMA_REQUEST_TIMER0_CH3             RM_CHXCFG_MUXID(23U)                            /*!< DMAMUX TIMER0 CH3 request */
#define DMA_REQUEST_TIMER0_TI              RM_CHXCFG_MUXID(24U)                            /*!< DMAMUX TIMER0 TI request */
#define DMA_REQUEST_TIMER0_UP              RM_CHXCFG_MUXID(25U)                            /*!< DMAMUX TIMER0 UP request */
#define DMA_REQUEST_TIMER0_CO              RM_CHXCFG_MUXID(26U)                            /*!< DMAMUX TIMER0 CO request */
#define DMA_REQUEST_TIMER0_MCH0            RM_CHXCFG_MUXID(27U)                            /*!< DMAMUX TIMER0 MCH0 request */
#define DMA_REQUEST_TIMER0_MCH1            RM_CHXCFG_MUXID(28U)                            /*!< DMAMUX TIMER0 MCH1 request */
#define DMA_REQUEST_TIMER0_MCH2            RM_CHXCFG_MUXID(29U)                            /*!< DMAMUX TIMER0 MCH2 request */
#define DMA_REQUEST_TIMER0_MCH3            RM_CHXCFG_MUXID(30U)                            /*!< DMAMUX TIMER0 MCH3 request */
#define DMA_REQUEST_TIMER1_CH0             RM_CHXCFG_MUXID(31U)                            /*!< DMAMUX TIMER1 CH0 request */
#define DMA_REQUEST_TIMER1_CH1             RM_CHXCFG_MUXID(32U)                            /*!< DMAMUX TIMER1 CH1 request */
#define DMA_REQUEST_TIMER1_CH2             RM_CHXCFG_MUXID(33U)                            /*!< DMAMUX TIMER1 CH2 request */
#define DMA_REQUEST_TIMER1_CH3             RM_CHXCFG_MUXID(34U)                            /*!< DMAMUX TIMER1 CH3 request */
#define DMA_REQUEST_TIMER1_TI              RM_CHXCFG_MUXID(35U)                            /*!< DMAMUX TIMER1 TI request */
#define DMA_REQUEST_TIMER1_UP              RM_CHXCFG_MUXID(36U)                            /*!< DMAMUX TIMER1 UP request */
#define DMA_REQUEST_TIMER7_CH0             RM_CHXCFG_MUXID(37U)                            /*!< DMAMUX TIMER7 CH0 request */
#define DMA_REQUEST_TIMER7_CH1             RM_CHXCFG_MUXID(38U)                            /*!< DMAMUX TIMER7 CH1 request */
#define DMA_REQUEST_TIMER7_CH2             RM_CHXCFG_MUXID(39U)                            /*!< DMAMUX TIMER7 CH2 request */
#define DMA_REQUEST_TIMER7_CH3             RM_CHXCFG_MUXID(40U)                            /*!< DMAMUX TIMER7 CH3 request */
#define DMA_REQUEST_TIMER7_TI              RM_CHXCFG_MUXID(41U)                            /*!< DMAMUX TIMER7 TI request */
#define DMA_REQUEST_TIMER7_UP              RM_CHXCFG_MUXID(42U)                            /*!< DMAMUX TIMER7 UP request */
#define DMA_REQUEST_TIMER7_CO              RM_CHXCFG_MUXID(43U)                            /*!< DMAMUX TIMER7 CO request */
#define DMA_REQUEST_TIMER7_MCH0            RM_CHXCFG_MUXID(44U)                            /*!< DMAMUX TIMER7 MCH0 request */
#define DMA_REQUEST_TIMER7_MCH1            RM_CHXCFG_MUXID(45U)                            /*!< DMAMUX TIMER7 MCH1 request */
#define DMA_REQUEST_TIMER7_MCH2            RM_CHXCFG_MUXID(46U)                            /*!< DMAMUX TIMER7 MCH2 request */
#define DMA_REQUEST_TIMER7_MCH3            RM_CHXCFG_MUXID(47U)                            /*!< DMAMUX TIMER7 MCH3 request */
#define DMA_REQUEST_CAN1                   RM_CHXCFG_MUXID(48U)                            /*!< DMAMUX CAN1 request */
#define DMA_REQUEST_CAN0                   RM_CHXCFG_MUXID(49U)                            /*!< DMAMUX CAN0 request */
#define DMA_REQUEST_USART0_RX              RM_CHXCFG_MUXID(50U)                            /*!< DMAMUX USART0 RX request */
#define DMA_REQUEST_USART0_TX              RM_CHXCFG_MUXID(51U)                            /*!< DMAMUX USART0 TX request */
#define DMA_REQUEST_USART1_RX              RM_CHXCFG_MUXID(52U)                            /*!< DMAMUX USART1 RX request */
#define DMA_REQUEST_USART1_TX              RM_CHXCFG_MUXID(53U)                            /*!< DMAMUX USART1 TX request */
#define DMA_REQUEST_USART2_RX              RM_CHXCFG_MUXID(54U)                            /*!< DMAMUX USART2 RX request */
#define DMA_REQUEST_USART2_TX              RM_CHXCFG_MUXID(55U)                            /*!< DMAMUX USART2 TX request */
#define DMA_REQUEST_TIMER5_UP              RM_CHXCFG_MUXID(56U)                            /*!< DMAMUX TIMER5 UP request */
#define DMA_REQUEST_TIMER6_UP              RM_CHXCFG_MUXID(57U)                            /*!< DMAMUX TIMER6 UP request */
#define DMA_REQUEST_TIMER19_CH0            RM_CHXCFG_MUXID(58U)                            /*!< DMAMUX TIMER19 CH0 request */
#define DMA_REQUEST_TIMER19_CH1            RM_CHXCFG_MUXID(59U)                            /*!< DMAMUX TIMER19 CH1 request */
#define DMA_REQUEST_TIMER19_CH2            RM_CHXCFG_MUXID(60U)                            /*!< DMAMUX TIMER19 CH2 request */
#define DMA_REQUEST_TIMER19_CH3            RM_CHXCFG_MUXID(61U)                            /*!< DMAMUX TIMER19 CH3 request */
#define DMA_REQUEST_TIMER19_TI             RM_CHXCFG_MUXID(62U)                            /*!< DMAMUX TIMER19 TI request */
#define DMA_REQUEST_TIMER19_UP             RM_CHXCFG_MUXID(63U)                            /*!< DMAMUX TIMER19 UP request */
#define DMA_REQUEST_TIMER19_CO             RM_CHXCFG_MUXID(64U)                            /*!< DMAMUX TIMER19 CO request */
#define DMA_REQUEST_TIMER19_MCH0           RM_CHXCFG_MUXID(65U)                            /*!< DMAMUX TIMER19 MCH0 request */
#define DMA_REQUEST_TIMER19_MCH1           RM_CHXCFG_MUXID(66U)                            /*!< DMAMUX TIMER19 MCH1 request */
#define DMA_REQUEST_TIMER19_MCH2           RM_CHXCFG_MUXID(67U)                            /*!< DMAMUX TIMER19 MCH2 request */
#define DMA_REQUEST_TIMER19_MCH3           RM_CHXCFG_MUXID(68U)                            /*!< DMAMUX TIMER19 MCH3 request */
#define DMA_REQUEST_TIMER20_CH0            RM_CHXCFG_MUXID(69U)                            /*!< DMAMUX TIMER20 CH0 request */
#define DMA_REQUEST_TIMER20_CH1            RM_CHXCFG_MUXID(70U)                            /*!< DMAMUX TIMER20 CH1 request */
#define DMA_REQUEST_TIMER20_CH2            RM_CHXCFG_MUXID(71U)                            /*!< DMAMUX TIMER20 CH2 request */
#define DMA_REQUEST_TIMER20_CH3            RM_CHXCFG_MUXID(72U)                            /*!< DMAMUX TIMER20 CH3 request */
#define DMA_REQUEST_TIMER20_TI             RM_CHXCFG_MUXID(73U)                            /*!< DMAMUX TIMER20 TI request */
#define DMA_REQUEST_TIMER20_UP             RM_CHXCFG_MUXID(74U)                            /*!< DMAMUX TIMER20 UP request */
#define DMA_REQUEST_TIMER20_CO             RM_CHXCFG_MUXID(75U)                            /*!< DMAMUX TIMER20 CO request */
#define DMA_REQUEST_TIMER20_MCH0           RM_CHXCFG_MUXID(76U)                            /*!< DMAMUX TIMER20 MCH0 request */
#define DMA_REQUEST_TIMER20_MCH1           RM_CHXCFG_MUXID(77U)                            /*!< DMAMUX TIMER20 MCH1 request */
#define DMA_REQUEST_TIMER20_MCH2           RM_CHXCFG_MUXID(78U)                            /*!< DMAMUX TIMER20 MCH2 request */
#define DMA_REQUEST_TIMER20_MCH3           RM_CHXCFG_MUXID(79U)                            /*!< DMAMUX TIMER20 MCH3 request */

/* DMAMUX request generator trigger input identification */
#define RG_CHXCFG_TID(regval)              (BITS(0,4) & ((regval) << 0U))                  /*!< trigger input identification */
#define DMAMUX_TRIGGER_EXTI0               RG_CHXCFG_TID(0U)                               /*!< trigger input is EXTI0 */
#define DMAMUX_TRIGGER_EXTI1               RG_CHXCFG_TID(1U)                               /*!< trigger input is EXTI1 */
#define DMAMUX_TRIGGER_EXTI2               RG_CHXCFG_TID(2U)                               /*!< trigger input is EXTI2 */
#define DMAMUX_TRIGGER_EXTI3               RG_CHXCFG_TID(3U)                               /*!< trigger input is EXTI3 */
#define DMAMUX_TRIGGER_EXTI4               RG_CHXCFG_TID(4U)                               /*!< trigger input is EXTI4 */
#define DMAMUX_TRIGGER_EXTI5               RG_CHXCFG_TID(5U)                               /*!< trigger input is EXTI5 */
#define DMAMUX_TRIGGER_EXTI6               RG_CHXCFG_TID(6U)                               /*!< trigger input is EXTI6 */
#define DMAMUX_TRIGGER_EXTI7               RG_CHXCFG_TID(7U)                               /*!< trigger input is EXTI7 */
#define DMAMUX_TRIGGER_EXTI8               RG_CHXCFG_TID(8U)                               /*!< trigger input is EXTI8 */
#define DMAMUX_TRIGGER_EXTI9               RG_CHXCFG_TID(9U)                               /*!< trigger input is EXTI9 */
#define DMAMUX_TRIGGER_EXTI10              RG_CHXCFG_TID(10U)                              /*!< trigger input is EXTI10 */
#define DMAMUX_TRIGGER_EXTI11              RG_CHXCFG_TID(11U)                              /*!< trigger input is EXTI11 */
#define DMAMUX_TRIGGER_EXTI12              RG_CHXCFG_TID(12U)                              /*!< trigger input is EXTI12 */
#define DMAMUX_TRIGGER_EXTI13              RG_CHXCFG_TID(13U)                              /*!< trigger input is EXTI13 */
#define DMAMUX_TRIGGER_EXTI14              RG_CHXCFG_TID(14U)                              /*!< trigger input is EXTI14 */
#define DMAMUX_TRIGGER_EXTI15              RG_CHXCFG_TID(15U)                              /*!< trigger input is EXTI15 */
#define DMAMUX_TRIGGER_EVTX_OUT0           RG_CHXCFG_TID(16U)                              /*!< trigger input is Evtx_out0 */
#define DMAMUX_TRIGGER_EVTX_OUT1           RG_CHXCFG_TID(17U)                              /*!< trigger input is Evtx_out1 */
#define DMAMUX_TRIGGER_EVTX_OUT2           RG_CHXCFG_TID(18U)                              /*!< trigger input is Evtx_out2 */
#define DMAMUX_TRIGGER_EVTX_OUT3           RG_CHXCFG_TID(19U)                              /*!< trigger input is Evtx_out3 */
#define DMAMUX_TRIGGER_TIMER20_CH0_O       RG_CHXCFG_TID(22U)                              /*!< trigger input is TIMER20_CH0_O */

